image bg room32 = "images/bg/32.png"
image mom3 = "images/characters/others/mom3.png"

label l2_path:
    scene bg room32
    "金碧辉煌的大厅，衣着华丽的女人独自在徘徊。"
    show mom3 at stand_center with dissolve
    "赛琳""有谁在这里吗？"
    hide mom3 with dissolve

    "似乎是魔力微弱的人，虽然无法看见我，但是隐约能感受到我的存在。"
    show me at stand_center with dissolve
    "我""......"
    "我将魔力凝聚在手指，试图在空中书写下文字。"
    hide me with dissolve

    show mom3 at stand_center with dissolve
    "赛琳""“莉莉丝大人让我找你聊聊。”那个女神吗，居然真的存在啊。"
    "赛琳""“想要知道关于我的事......”"
    "赛琳""......"
    "赛琳""我是赛琳 阿祖拉，是这个国家的皇太后。"
    "赛琳""我的长女是这个国家的女帝，至于次女......据说是被选为你们这位女神的勇者了。"
    "赛琳""希望她不要给自己招惹什么麻烦。"
    hide mom3 with dissolve

    "女人的语气听起来特别平淡，貌似孩子们的荣耀对她来说并不重要。"
    
    show mom3 at stand_center with dissolve
    "赛琳""那是当然。"
    "赛琳""身为大臣的女儿，拼尽全力成为皇后，丈夫却有个私生子，而那个私生子如今成了宰相爬到我的头上。"
    "赛琳""丈夫死了倒也是好事，可惜是被藏在皇宫里的疯婆子杀了，不知道又给我留下多少丑闻。"
    "赛琳""至于孩子们......"
    "赛琳""我给老东西孕育了五个孩子:两个尖耳朵的被国民捧上了天，可惜一个不知道是死了还是怎么反正现在都了无音讯。"
    "赛琳""至于后面的三个女儿，等她们长大成人了也许会嫁人成为某个国家的女王吧。"
    "赛琳""......"
    "赛琳""......这本来就不关我的事不是吗？"
    "赛琳""生下这些孩子仅仅是我的职责，我想要的一人之下万人之上的荣华富贵已经实现过了。"
    "赛琳""......你想清楚，现在在我头顶的可算是有三个人，我的长女，那个私生子，还有你们那个女神。"
    "赛琳""哈？亵渎，她也不过是魔力强大的长生种不是吗，她什么都做不到。"
    "赛琳""什么命运，不就是她自己玩着开心的角色扮演罢了。"
    "赛琳""几十年前圣女和勇者在边境拼死抵御魔物，现在不还是有脏东西涌进来，你也是其中一样。"
    hide mom3 with dissolve

    show me at stand_center with dissolve
    "我""......"
    "亡灵也是魔物，这是事实。"
    hide me with dissolve

    show mom3 at stand_center with dissolve
    "赛琳""现在又选出新的勇者有什么用，她一下子退掉的婚约真不知道给我们惹了多少麻烦。"
    "赛琳""我同不同意又有什么用，大部分国民都追随这个女神，那个私生子只会笑眯眯地揽下脏活累活也不怕过劳死。"
    "赛琳""因为所谓女神的预言，皇室兄弟姐妹结合的人不少，都是一群疯子。"
    "赛琳""女帝在失去她的兄弟之后就变得沉默寡言，她也开始逐渐不信任你们的女神了。"
    "赛琳""总有一天会到来的......"
    "赛琳""那个女神不在了的那一天......"
    "赛琳""没有魔物，没有魔力，只有人类。"
    "赛琳""我们无法改变过去的任何事，这个女神也做不到。"
    "赛琳""不如一直向前看......"
    hide mom3 with dissolve

    "我实在忍受不了女人渎神的言语，只能默默离去。"
    "......"
    "但她说的有那么几句在我脑中萦绕，久久不能散去。"
    "如果她能够看见我......"
    "应该能认出我的身份了吧......"

    menu:

        "活泼的女人":
            jump l1_path

        "悲伤的女人":
            jump l3_path


    return




    
