image bg room27 = "images/bg/27.png"
image bg room28 = "images/bg/28.png"
image bg room29 = "images/bg/29.png"

transform stand_center_shake:
    zoom 0.50
    xalign 0.5
    yalign 1.0
    linear 0.05 xoffset -10
    linear 0.05 xoffset 10
    linear 0.05 xoffset -10
    linear 0.05 xoffset 10
    linear 0.05 xoffset 0

label l3_path:
    scene bg room27
    "悲伤的女人，也是同样迷失的亡灵。"
    "她在等谁吗？"

    show mom1 at stand_center with dissolve
    "莉莉娅""你好。"
    "身形单薄的女人，仿佛风一吹就会倒。"
    "莉莉娅""生面孔啊，你是新来的吗？"
    "不，我已经在这里迷茫很久了......"
    "莉莉娅""这样啊......"
    "莉莉娅""你看起来还很年轻，应该和我的孩子差不多大。"
    "你为什么在这里，能和我讲讲你的故事吗？"
    "莉莉娅""我吗？我的故事......没什么大不了的。"
    "莉莉娅""我是圣女莉莉娅。"
    "莉莉娅""我......并不是什么信仰坚定的人......"
    "莉莉娅""所以现在才落得如此下场吧。"
    hide mom1 with dissolve

    scene bg room28
    "莉莉娅""魔物肆虐，战火纷飞，国家存亡危急之刻......"
    "莉莉娅""年少的我与兄长被派往前线，只因为我们拥有最高贵最神圣的血脉，我们会得到莉莉丝的祝福，带领军队赢得胜利。"
    "莉莉娅""可惜兄长的运气并没有那么好。"
    "莉莉娅""我可怜的兄长身负重伤，不得不回到王城休养。"
    "莉莉娅""而我只能独自和士兵们打交道。"
    "莉莉娅""大家最爱的话题就是战争结束后的生活。"
    "莉莉娅""期待着升官发财，带着全家去繁华的城市生活。"
    "莉莉娅""去驻守王城，过上衣食无忧的日子。"
    "莉莉娅""......"
    "莉莉娅""大部分的人都想往里走，而我只想往外逃。"
    "莉莉娅""皇族并没有表面上看起来那么光鲜亮丽，这里的人都是一群疯子。"

    scene bg room29
    "莉莉娅""一群盲目的，疯狂的信徒......"
    "莉莉娅""一个无可救药的傲慢的神明......"
    "莉莉娅""她哄骗他们，有血缘关系的那些人，生下一个又一个畸形的，不正常的孩子......"
    "莉莉娅""那些幻觉，他们美其名曰为神谕......"
    "莉莉娅""我好不容易遇到一个愿意带我离开的人......"
    "莉莉娅""我会有一个健康的孩子......"
    "莉莉娅""一个不被莉莉丝束缚的孩子......"

    play music "audio/bgm/3.mp3" fadein 3
    scene bg room27
    show mom1 at stand_center
    "莉莉娅""我的孩子在哪！"
    "莉莉娅""他去哪了！"
    "莉莉娅""为什么他要把我关起来！"
    "莉莉娅""我没有疯！疯掉的是他！"
    "莉莉娅""莉莉丝是骗子！"
    "请你冷静一点......"
    "莉莉娅""他把我关起来，然后带走我的孩子。"
    "莉莉娅""时间不会在我的宝贝的脸上留下痕迹，所以他答应我他会把头发留长。"
    "莉莉娅""他写信说他遇到了爱他的人，他说他要去我向往的那个地方，他说他有了一个新的家庭。"
    "莉莉娅""他说他会尽力接我出来，我们一起生活。"
    "莉莉娅""莉莉丝啊，为什么他的身体如此冰冷。"
    "莉莉娅""为什么那个疯子只是笑着看这一切。"
    "莉莉娅""他凭什么说我的孩子是不要命的废物！"
    "莉莉娅""为什么......"
    "莉莉娅""我准备了那么多魔法......"
    "莉莉娅""我希望他能逃脱那个疯子女神的魔爪......"
    "莉莉娅""我......我没有别的办法......"
    "莉莉娅""我不希望他被莉莉丝找到。"
    "莉莉娅""所以我用了......"
    "莉莉娅""......"
    "莉莉娅""所以我在这里......"
    "莉莉娅""原来我已经......"
    "莉莉娅""那我的孩子呢？"
    "莉莉娅""他还好吗？"
    "莉莉娅""你有见到过他吗？"
    "莉莉娅""他应该和你差不多高。"
    "莉莉娅""耳朵和你一样，都是尖尖的。"
    "莉莉娅""头发和眼睛的颜色不一样。"
    "莉莉娅""你有见到他吗，有的吧，他在哪，你能带我去见他吗？"
    "她紧紧抓住我的衣服不放，现在我觉得她的精神可能真的不太正常。"
    "莉莉娅""带我去找我的孩子！"
    "莉莉娅""带我去找......"

    hide mom1
    stop music
    show bg room27 at shake
    show lilith0 at stand_center_shake
    pause 0.5
    show bg room27

    play music "audio/bgm/4.mp3" fadein 2.0
    "莉莉丝""够了。"
    "莉莉丝""这个女人已经完全疯了。"
    "莉莉丝""满口胡言。"
    "莉莉丝""让她来提供证言完全是错误的选择。"
    "莉莉丝""不要让她浪费我们的时间。"
    "莉莉丝""走了。"

    "莉莉丝大人似乎想要隐瞒什么事情......"
    "接下来的选择非常重要，似乎对未来的影响很大......"
    "......"

    menu:
        "跟着莉莉丝大人离开":
            jump m_path

        "违抗莉莉丝大人":
            jump end1_path

return