label end1_path:
    "莉莉丝""这样啊......"
    "莉莉丝""你，你也是残缺的灵魂......"
    "莉莉丝""你和这个女人的想法一样吗？"
    "莉莉丝""愚昧的人类，你真的愚蠢至极，无可救药......"
    "莉莉丝大人扯下了一根头发，将其燃烧成灰烬。"
    "莉莉丝""残缺的灵魂。"
    "我感受到我的存在正在消失。"
    scene bg room0
    "莉莉丝""必须去寻找......"
    "莉莉丝""......真正的亚当......"
    "End 1"
    "残次品"

    $ renpy.block_rollback()
    $ _skipping = False
    $ _dismiss_pause = False

    play movie "video/Lilea.webm"
    $ renpy.pause(30.0, hard=True)
    stop movie

    $ persistent.end1_unlocked = True

    return

label end2_path:
    show me at stand_center with dissolve
    "我""......"
    "我""夏娃......"
    "我""夏娃还在等我带诺亚回去......"
    "我""夏娃还一个人在等她的哥哥......"
    "我""我不能让夏娃孤单。"
    "我""莉莉丝大人，该怎么让诺亚回去。"
    hide me with dissolve

    "莉莉丝""看来你终于想清楚了。"
    "莉莉丝""亚当就应该回到夏娃身边。"
    "莉莉丝""没有什么可以分开兄妹两人......"
    "莉莉丝大人拿出了一把金色的剪刀，剪断了衣服上的丝带，四周茫然的亡灵突然全部围了过来。"
    "莉莉丝""真正的亚当已经找到......已经不需要别的流程了。"
    "莉莉丝""你们都会成为祭品，帮助他成神......"
    "莉莉丝""亚当会永远和我在一起。"
    "莉莉丝""而你，我可爱的孩子，同样也命为亚当的听话的，懂事的孩子......"
    "莉莉丝""很快你的妹妹也会在这里，你们将在无尽的黑夜里团聚......"
    "End 2"
    "兄妹团聚"

    $ persistent.end2_unlocked = True

    return