image bg room3 = "images/bg/3.png"
image bg room4 = "images/bg/4.png"
image bg room5 = "images/bg/5.png"
image bg room6 = "images/bg/6.png"
image bg room7 = "images/bg/7.png"
image bg room8 = "images/bg/8.png"
image e1= "images/characters/others/elf1.png"
image e2= "images/characters/others/elf2.png"
image s= "images/characters/others/man1.png"

image Nova = "images/characters/Nova/1.png"

$ current_avatar = "images/characters/Nova/0.png"

transform stand_1:
    anchor (0.5, 1.0)
    align (0.25, 1.0)
    zoom 0.5
    yoffset 25

transform stand_2:
    anchor (0.5, 1.0)
    align (0.75, 1.0)
    zoom 0.5
    yoffset 25
label a_path:
    
    "——公主——"
    $ current_avatar = "images/characters/Nova/0.png"
    "黑发的人类少女，看起来有点紧张"
    $ current_avatar = None
    
    show Nova at stand_center with dissolve
    "公主" "唉！从我开始吗？"
    "公主" "该，该从哪里开始讲？"
    "公主" "从头开始......从一开始，那我慢慢讲吧。"
    "公主" "我的名字是诺娃-阿祖拉(Nova Azula)，是公国的长公主。"
    "公主" "是先王第一个人类孩子。"
    hide Nova with dissolve

    scene bg room3
    "阿祖拉公国是当今最强大的国家，也是莉莉丝大人信徒最多的国家。"
    "也是如今诸神离去的生者世界唯一有异种的国家。"
    show e1 at stand_1 with dissolve
    show e2 at stand_2 with dissolve
    "被祝福的孩子，莉莉丝大人的后裔们在诞生之时便有着和莉莉丝大人相似的长耳。"
    "俊美的外貌，高挑的身材，还有比人类长数倍的寿命。"
    "他们被称为半精灵，其实和精灵本身没有什么血缘关系。"
    hide e1 with dissolve
    hide e2 with dissolve
    "毕竟神明和其他种族离开这片大地已经两千年了。"
    "公国现在的统治者，女帝夏娃也是一名半精灵。"
    "有她的带领，公国必将长盛不衰。"

    scene bg room2
    show Nova at stand_center with dissolve
    "公主""我是她的妹妹。"
    "公主""和被祝福的哥哥姐姐们相比，我的存在根本不重要。"
    hide Nova with dissolve
    scene bg room4
    "公主""出生，长大，然后联姻远嫁他乡。"
    "公主""枯燥无味的皇族生活......一眼就望到头的人生......"
    "公主""姐姐继承皇位后，我似乎有了别的机会。"
    "“成为一名优秀的骑士，为国家而战吧。”"
    "公主""于是我丢掉礼仪课程，开始训练剑术和魔法。"
    scene bg room3
    "公主""之后如愿以优秀的成绩进入皇家骑士学院。"
    "公主""在那里，我遇到了自己的救世主(Messiah)。"
    "公主""皇家的学院无非是个缩小化的贵族社会，身为公主的我自然被他们推到了学生们的顶端。"
    "公主""如果会一直这么无趣下去的话还不如嫁人算了，至少能跑到别的地方去。"
    "公主""同学们的目光令我感到窒息，我认得他们，在过去无数的社交舞会和聚餐时见过。"
    "公主""稍微陌生一点的面孔也会成为其他人的议论对象，半天之内他们的家底就会被扒干净。"
    "公主""我不关心这些事，只想快点一个人呆着，闷着头往宿舍走。"
    "学院为了拉近学生之间的关系貌似会安排室友吧......"
    "不知道公主殿下是否能和室友友好相处。"
    "公主""大哥给我专门安排了一个室友，我相信他的选择。"
    scene bg room5
    "公主""这就是我的弥赛亚，虽然一开始我并没有给她甩什么好脸色。"
    "公主""她说她是叔叔招募进来的，我没有听说过这个人的名字，也许是某个人的假名，也许她是某个人的私生子。"
    "公主""她来自边境的村庄，纯净地像一张白纸。"
    "公主""真的有这么单纯的人吗，我对她抱有一丝怀疑。"
    "公主""就这样，我不怎么愉快的校园生活就开始了。"
    "虽说她的经历听起来有些无趣，但是没满二十岁的小姑娘也确实没经历过什么吧。"
    "我有预感，她后面会讲她的恋爱故事了。"
    scene bg room2
    show Nova at stand_center with dissolve
    "公主""我也不是什么无趣之人，读过一些平民间的小说。"
    "公主""若是当一个傲慢无礼的公主，总有一天会被平民天才反杀。"
    "公主""不过最好的情况是她会抢走我的未婚夫之类的，这样的剧情最好。"
    "公主""但是我那时候也没见过我的婚约者，只好先试着和她好好相处。"
    "这种题材的小说一直都很流行啊，玛丽苏文学什么的。"
    "虽说对王公贵族有些大不敬但毕竟是虚构的情节，在上流社会之间也会稍有流通。"
    "公主殿下也会看这种小说，应该还是个小姑娘。"
    "公主""她确实很特别。"
    "公主""她是聪明的，不是抽象的灵感，而是那种来自纯粹求知欲、对真理执念的锐利。"
    "公主""她也很友善，虽然不懂得具体的贵族礼数，但并不会有失礼的举止。"
    "公主""不知不觉中我已经完全被她吸引。"
    "公主""阳光落在她发梢时，那一抹柔光能让我忘了王宫的所有金箔与权杖。"
    "公主""与我在书上看过的不一样，她尽量和所有人都保持着距离，好像有什么秘密。"
    "公主""在闲暇时间她总是在写信，给王城的叔叔写信，给边境的母亲写信。"
    #公主立绘消失
    scene bg room6
    "公主""她生活的边境无名村庄，曾遭受过严重的魔兽侵袭。"
    "公主""在边境骑士的守卫下村庄并没有什么伤亡，但有六名骑士至今下落不明。"
    "公主""曾经惊动王城的事件......村民们现在也还在帮忙寻找他们。"
    "公主""她说叔叔是那个小队的幸存者，我多少能猜到这位叔叔的身份了。"
    "公主""毕竟只有两个人回来了......"
    scene bg room2
    "那六个人的灵魂，在这里吗......"
    show Nova at stand_center with dissolve
    "公主""就这样时间流逝着，我们的关系也越来越好，我很高兴她没有疏远我。"
    "“叔叔说我可以信任你，他说他就是专门安排我们住一起的。”"
    "公主""这一刻我才意识到我猜错了人。"
    "公主""我立马带着她去见我大哥。"
    hide Nova with dissolve
    show Noah at stand_center with dissolve
    "“是我安排的哦，你们两个没有好好交流过吗，我以为你们玩得很开心完全把我忘了。”"
    "公主""一直笑眯眯的大哥是我父亲的私生子，而她的母亲应该是和大哥同母异父的妹妹。"
    hide Noah with dissolve
    "公主""我还以为这个神秘的叔叔是我大哥的侍卫，我一直不是很喜欢那家伙。"
    
    show Noah at stand_center with dissolve
    "“美好的校园生活当然要多交朋友啦，我知道你们成绩很优秀但也要多出去玩啦。”"
    hide Noah with dissolve
    "公主""我们在大哥面前才彻底敞开了心扉。"
    "公主""她撩起了她的头发，我这才知道她和其他人保持距离的原因。"
    "公主""她是半精灵，因为担心在王城被人说闲话才一直这么低调。"
    "公主""她说她在那个事件之后就能听见莉莉丝大人的声音，我想她确确实实是被选中的人。"
    "公主""她也许就是圣女吧，应该在这个国家受到万人追捧，但这样大哥不应该掩埋她的存在啊。"
    show Noah at stand_center with dissolve
    "“我也不想被说闲话啊，再说圣女出现时机也太巧了吧，刚好就是那个时候。”"
    "“之后会安排那种官方授权仪式战斗祭典之类的，你知道的我是无神论者。”"
    "“而且按照预言我们现在还缺少一名勇者啊，还请莉莉丝大人快快显灵安排一下。”"
    hide Noah with dissolve
    "莉莉丝大人曾说过，勇者和圣女是她给人类最后的救赎之路。"
    "她将自己的痛苦一遍又一遍重写......"
    "人类是有罪的。"
    show Nova at stand_center with dissolve
    "公主""我一时陷入了慌乱，我害怕她和别人绑定，我害怕我会就此和她错过。"
    "公主""在这一刻我希望我就是那个勇者。"
    "公主""因为哥哥姐姐我本不是什么信仰很坚定的人，但之后我便相信了命运的安排。"
    "公主""大哥给了我一个机会，第一学年结束后的假期，我的婚约者索尔文王子会前来王城参观。"
    "公主""皇宫会安排一场骑士决斗，我可以向所有人展现我的实力，大姐自然会帮我退婚。"
    "公主""我又想起了那些小说的情节，也许这个索尔文王子过来会爱上她，可能这家伙是尚未出现的勇者。"
    "公主""我非常焦虑，一着急直接向她表露了自己的心声。"
    hide Nova with dissolve
    show Isaiah at stand_center with dissolve
    "“其实，我也对你......”"
    hide Isaiah with dissolve
    show Nova at stand_center with dissolve
    "小公主的嘴角开始不由自主地上扬。"
    "公主""之后我们建立了......比朋友更亲密的关系。"
    "公主""她陪着我去训练，而我会和她一起去祷告。"
    "公主""我个人对大哥的侍卫有偏见，但不得不承认他的实力，于是拜他为师锻炼剑术。"
    hide Nova with dissolve
    scene bg room7
    "公主""索尔文王子拜访的日子很快就到来了。"
    "公主""整个王城热闹得像是在举办某种庆典。"
    "公主""我不知道我的对手是谁，但是看大哥一脸看乐子的表请我就有不好的预感。"
    "公主""也许是他自己，也有可能是他的侍卫，甚至有可能是我的弥赛亚......"
    "“那么，我们另一位决斗者是————来自帝国的索尔文王子！”"
    "公主""大哥在看台笑得人仰马翻，而她在一旁挥舞着花束。"
    "公主""我知道，我必须赢。"
    "公主""可是索尔文那家伙也不是吃素的。"
    "公主""一开始我们还势均力敌，几个回合之后我手中的剑竟直接被他击飞。"
    show s at stand_center with dissolve
    "“我的要求只有一个，我要和你退婚。”"
    hide s with dissolve
    "公主""我的愿望达成了一个，接下来开始担心另一件事，万一他对弥赛亚一见钟情......"
    show s at stand_center with dissolve
    "“什么啊，你们这边也很流行这种小说吗？”"
    "“放心好了，我有自己的秘密恋人。”"
    hide s with dissolve
    "公主""一番交流下来已把这家伙当成了好伙伴。"
    "公主""晚上的宴会我们都想翘掉，希望大哥能帮我们打好掩护。"
    show Noah at stand_center with dissolve
    "“我都帮你们想好剧本了，就说你们偷偷出去约会，结果三观不合大吵一架，双双要求退婚，这真是太完美了。”"
    "“但是我不能只让你们去玩，把亚修带上。”"
    hide Noah with dissolve
    "公主""大哥确实退让了很多步，我们当然要接受，反正那家伙也只会默默在远处跟着。"
    "公主""虽然输掉了决斗，但是愿望都实现了。"
    "公主""在黑暗中我牵着弥赛亚的手，欣赏着王城的烟花。"
    "公主""过于充实的一天......"
    "公主""而在那一天预言也在我身上实现......"
    scene bg room8
    "公主""我梦到了金色的参天大树，那是传说中神明诞生的地方。"
    "公主""金发的女子让我枕在她的膝盖上，在我耳边低语："
    show lilith0 at stand_center with dissolve
    "“被祝福的孩子啊，你将得到你想要的一切。”"
    hide lilith0 with dissolve
    "公主""莉莉丝大人来找我了，我真的是她选中的人。"
    scene bg room2
    show Nova at stand_center with dissolve
    "公主""醒来后我将梦里的场景告诉了弥赛亚，抱起她开始欢呼。"
    "公主""当然也告诉了大哥。"
    hide Nova with dissolve
    show Noah at stand_center with dissolve
    "“真是多喜临门啊，看来我该去准备一下仪式和公告了。”"
    "“交给我就行，假期还有一段时间，你们可以考虑出去玩一圈再回来。”"
    hide Noah with dissolve
    show Isaiah at stand_center with dissolve
    "“既然如此，要不要去我的故乡看看。”"
    "“我给妈妈提到过你很多次，她也想见见你。”"
    hide Isaiah with dissolve
    show Nova at stand_center with dissolve
    "公主""我当然不可能拒绝这个提议，立马前去购入礼物再收拾行李。"
    "公主""正好索尔文也快要回去了，我们蹭了他的豪华马车和护卫队一路畅通无阻去到了边境。"
    "公主""最后一节去村庄路我们只能自己走，沿途是无边的草地，远处是绵延的山脉。"
    hide Nova with dissolve
    scene bg room6
    "公主""我一眼就爱上了这里，我在王城不可能见到的风景。"
    "公主""如果成为王城骑士，我依然只能呆在那金碧辉煌的地方。"
    "公主""或许我能成为一名边境骑士，像大哥曾经那样。"
    "公主""我远远地看见一个女人在村口招手，身旁的弥赛亚直接向她跑去。"
    "公主""那是她的母亲，有和大哥一样深绿色的眼睛。"
    "公主""她在边境经营着自己的酒馆，那里是骑士们最喜欢的小店。"
    "公主""我和弥赛亚玩得很开心，在这期间我几乎坚定了我要成为边境骑士的决心。"
    "公主""我也得知了一些别的秘密。"
    "公主""她的母亲并非是大哥的异父妹妹，而是同一个父亲。"
    "公主""那么应该和我是同一个父亲的大哥，到底是谁的孩子。"
    "公主""带着这样的疑问，我和弥赛亚踏上了返程之路。"
    "公主""本应早就到达歇脚的小城市，通往城市的道路却一眼望不到头。"
    "公主""天色渐晚，回过神来我已经在了这里。"
    
    scene bg room2
    "她的意思是这个大哥一直在说谎吗......"
    "不如说在她的故事中，这个人给人的感觉一直都怪怪的......"
    "接下来该听听谁的叙述呢？"

    #选项跳转
    menu:

        "宰相":
            jump b_path

        "圣女":
            jump c_path

        "侍卫":
            jump d_path

        "应该没什么要听的内容了。":
            jump e_path


    return
