image bg room3 = "images/bg/3.png"
image bg room9 = "images/bg/9.png"
image bg room10 = "images/bg/10.png"
image bg room11 = "images/bg/11.png"
image bg room12 = "images/bg/12.png"
image bg room13 = "images/bg/13.png"
image bg room14 = "images/bg/14.png"
$ current_avatar = "images/characters/Noah/0.png"
image Noah = "images/characters/Noah/1.png"

label b_path:

    "——宰相——"
    $ current_avatar = "images/characters/Noah/0.png"
    "精灵......不对，是半精灵，只是微笑着注视某处"
    $ current_avatar = None
    
    show Noah at stand_center with dissolve
    "宰相" "嗯，你在说我？"
    "宰相" "抱歉我没有魔力，不太能感受到你们的存在。"
    "宰相" "要从头开始说吗？那有点长了哦。"
    "宰相" "别看我这样，我都快六十岁了。"
    "宰相" "我的名字是诺亚-阿祖拉(Noah Azula)，是公国的宰相。"
    "宰相" "是先王的长子......不过是私生子。"
    hide Noah with dissolve

    scene bg room9
    "宰相" "曾拯救了整个国家的英雄遇人不淑，生下了我。"
    "宰相" "之后精神失常，被禁足在皇家大花园深处的宅邸。"
    "宰相""那无尽的花海是困住我母亲一生的迷宫。"
    "宰相""我们都是皇宫里见不得光的人。"
    "宰相" "我在那里度过了我的前半生，而她在那里度过了她的余生。"

    scene bg room2
    show Noah at stand_center with dissolve
    "宰相" "说是半精灵，不过是青年时期比人类长很多罢了。"
    "宰相" "除了有尖尖的耳朵，我就和普通小孩一样长大。"
    "宰相" "真的很普通，可以说是平庸，甚至是废物。"
    "宰相" "皇族长子，莉莉丝的后裔，却是个没有一丝魔力的人。"
    "宰相" "不过正是因为不受重视，我才能做更多的事。"
    "宰相" "二十余年，宅邸里的仆人换了一批又一批，我也将能摸到的书翻了一遍又一遍。"
    hide Noah with dissolve

    scene bg room10
    "宰相" "随着时间流逝，母亲的状态好了很多，她不再哭号，而是一个人静静地坐在窗边，不知道望向何处。"
    "宰相" "直到有一天她又开始尖叫。"
    "宰相" "顺着她的目光，我看见的是国王和两个尖耳朵的孩子。"
    "“这是你的弟弟妹妹，从今往后你将和他们一起生活一起学习。”"
    "宰相" "我原以为他们也是被丢弃在这里的私生子，他们却拉着我的手走出宅邸的大门。"
    "宰相" "当我反应过来望向窗户时，母亲只给我留下了背影。"

    scene bg room3
    "宰相" "我开始学习礼仪和政治。"
    "宰相" "我拿起孩童用的木剑学习剑术。"
    "宰相" "那两个孩子是王后所生的，这个国家未来的王，而我只要之后辅佐他们就可以了。"
    "宰相" "无法造成任何威胁，不被世人接受的我......"
    "宰相" "也不被允许回到那座宅邸。"

    scene bg room2
    show Noah at stand_center with dissolve
    "宰相" "但我并非完全孤立无援。"
    "宰相" "前任宰相的私生子，我的侍从，那个也在某个宅邸被关了很久的孩子，有一天被他们丢到我的面前。"
    hide Noah with dissolve

    scene bg room11
    "宰相" "红色的，火焰一般的那个孩子......"
    "宰相" "对我百依百顺的那个孩子......"
    "宰相" "我需要一个绝对的后盾，所以我对他好，尽全力培养他。"
    "宰相" "我亲自教他剑术，还教了他很多魔法理念知识。"
    "宰相" "和我不同，他是个法术天才，如果仅仅是我做他的老师的话那就太屈才了。"
    "宰相" "于是我动用了一些关系将他送去了皇家骑士学院。"
    "宰相" "他会成为优秀的皇家骑士......我个人的骑士不也是皇家的骑士吗......这么看来我也没干什么滥用职权的事。"

    scene bg room2
    "他耸了耸肩。"
    "身为权贵之人，他确实没做什么错事。"
    
    show Noah at stand_center with dissolve
    "宰相" "小孩长得太快了，转眼间就比我还高了。"
    "宰相" "他交了很多朋友，我很高兴大家都喜欢他。"
    "宰相" "又高又帅的小伙子还品学兼优，青春期有几个人能拒绝这样的人。"
    "宰相" "但我完全不担心他会选择别人。"
    "宰相" "我知道他看我的眼神和看其他人不一样。"
    hide Noah with dissolve

    scene bg room12
    "宰相" "我纯洁的小狗眼里充满了名为欲望的污秽的情感。"
    "宰相" "这正是我想要的。"
    "宰相" "青春，真好啊......"
    "宰相" "一点点煽风点火，一点点冲动，再加上一点点酒精，就可以拿下。"
    "宰相" "只要有一个人就够了，我也该扔掉脑子多出去找找乐子了。"

    scene bg room2
    show Noah at stand_center with dissolve
    "宰相" "我再次小小利用了一下自己的职权，为他和我都申请了边境骑士的位置。"
    "宰相" "这个王城真的哪哪待着都不舒服，疯了的母亲，自私的父亲，那两个孩子还不错，但是长得太像老国王了，我实在喜欢不起来。"
    "宰相" "有一点可惜的是，我的第二个妹妹才刚能追着我跑我就要离开了，这孩子我还算有点好感。"
    "宰相" "希望走的那天她没把嗓子哭哑。"
    "宰相" "总之，我的愿望是！远离皇权！远离官场！出不了国就找个偏远的地方享受乡村生活。"
    hide Noah with dissolve

    "但是他现在是宰相吧，为什么还是回来了。"

    show Noah at stand_center with dissolve
    "宰相" "都过去好多年了，等我慢慢讲啦。"
    "宰相" "我的侍卫可是从青年变成大叔了。"
    "宰相" "真的......很多很多年，我生命中最幸福的那些年。"
    hide Noah with dissolve

    scene bg room6
    "宰相" "军营的附近有一个小村庄，我在自由活动时间就喜欢带着他去那边逛。"
    "宰相" "无边的草地，绵延的山脉。"
    "宰相" "和令人窒息的花园完全相反，自由广阔的天空。"
    "宰相" "我在那里遇到了我最喜欢的小姑娘。"
    "宰相" "温馨提示，不是那种喜欢。"
    "宰相" "我一眼就看出来小姑娘和我有血脉关系，她也是。"
    "宰相" "反正我在边境给自己编了一个完美的身份，所以我毫不犹豫和她认亲了。"
    "宰相" "小姑娘还有一个小小姑娘，金发碧眼长得像洋娃娃，但是她也有尖耳朵。"
    "宰相" "......"
    "宰相" "但是这一个小小的理由不影响我们之间的关系，我在边境有一个完美的新家庭，我的爱人，我可爱的妹妹，还有这个小小的侄女。"
    "宰相" "小姑娘在独自经营着一家酒馆，我经常带着队友们来照顾她的生意。"
    "宰相" "真的每一天，每一天都很快乐。"
    "宰相" "......"
    "宰相" "可是日子不会这样一直平静下去。"

    scene bg room13
    "宰相" "边境划开的并不是和其他国家的界限，而是源源不断的魔兽。"
    "宰相" "我们知道它们从外边的森林里冒出来，但无论怎么巡查都找不到它们诞生的痕迹。"
    "宰相" "前任圣女布下的结界越来越弱了，它们甚至会在我们喝酒狂欢的时候闯入。"
    "宰相" "我们不得不加强巡查力度。"
    "宰相" "就有那么一天，小小姑娘告诉我，她做了很奇怪的梦。"

    scene bg room8
    "宰相" "梦里是金色的大树，树下金发的女人告诉她很多不可思议的事。"
    "宰相" "母亲做过同样的梦，我知道，那就是莉莉丝。"
    "宰相" "我可爱的小小姑娘真的是神选之人。"

    scene bg room6
    "宰相" "小小姑娘在那之后就有了预言的能力，她告诉我们魔兽会从哪里爬上来，我们提前去做好准备就行。"
    "宰相" "队友们受伤的次数越来越少，村子也越来越繁荣。"
    "宰相" "原以为我们可以一直这样幸福下去......"
    "宰相" "那天小小姑娘哭着来找我，扯住我的衣角让我不要去。"
    "宰相" "她说我们回不来的。"
    "宰相" "嗯，我们要去的话当然首先需要她告诉我们去哪，但她也只是哭。"
    "宰相" "那我们不去她想说的地方坏预言应该就不会成真了吧，抱着这样的想法，我们决定今天只做一次简单的巡逻。"
    "宰相" "我刚才说过，魔兽会从某个地方爬上来。"

    scene bg room13
    "宰相" "原本只有花花草草的地面会出现数个黑色的裂缝，它们会从那里上来。"
    "宰相" "巡逻到了森林深处也没有见到过黑色裂缝，我们决定结束今天的工作。"
    "宰相" "转身的那一刻，突然有无数只黑色的手将我向后拽，紧接着我失去了所有感觉。"
    "宰相" "没有声音，没有光亮，甚至感觉不到自己的存在。"
    "宰相" "可能我就这样突然死了。"
    "宰相" "不过现在才更像死了，你们不都是亡灵什么的在听我说话吗。"
    "宰相" "是的，我那时候还活着。"

    scene bg room14
    "宰相" "梦里是一片血海和母亲的尸体。"
    "宰相" "我已经很久没见过她，没和她说上一句话了。"
    "宰相" "她是否还健在，她是否会得知我的死讯"
    "宰相" "......"
    
    scene bg room2
    "宰相" "再次睁眼，看见的是憔悴的我的亚修。"
    "宰相" "他紧握着我的双手痛哭。"
    "宰相" "其他六个人至今下落不明，只有我们靠着应急的传送法术逃过一劫。"
    "宰相" "还有其他更坏的消息。"
    "宰相" "我的母亲去世了，和老国王，那个对外宣称是我父亲的人一起割喉自尽了。"
    "宰相" "现在的国王是我的妹妹夏娃，她要处理的事务太多，完全无暇于看望我。"
    "宰相" "我好像睡了很久。"
    "宰相" "我先是安抚好了亚修的情绪，然后让他拿来了纸和笔，我要给小姑娘们报个平安。"
    "宰相" "......"

    show Noah at stand_center with dissolve
    "宰相" "之后的事就没什么好说的了。"
    "宰相" "我需要养伤，还要辅佐我可怜的女帝妹妹。"
    "宰相" "她因为短时间内发生的事太多，整个人也神经兮兮的，我必须要帮帮她。"
    "宰相" "当然了，她也不希望我们再前去边境了。"
    "宰相" "干了那么几年，我才爬到了宰相的位置。"
    "宰相" "算了一下小小姑娘也到了可以入学骑士学院的年纪，于是便邀请她们到王城生活。"
    "宰相" "小姑娘拒绝了，她说她不想离开自己的家乡，而且村民们还在想办法找到那六个人，只让小小姑娘一个人先过来读书。"
    "宰相" "几年过去那六个人都毫无音讯，我早已不抱有希望。"
    "宰相" "......也许小小姑娘还有办法呢，她不是莉莉丝选中的圣女吗。"
    "宰相" "向神明祈祷也好，传达神明的预言也好，说不定能找到他们呢。"
    "宰相" "我应该给她准备一个更正式的仪式，至少显得自己虔诚一点，好让神明可以搭理我一下。"
    "宰相" "我开始泡在图书馆查阅资料，而亚修去帮我寻找仪式用到的祭品和药水。"
    "宰相" "准备得差不多了，我们将物品都放在了神殿的储物室，接下来只要等放假回乡的小小姑娘回来就可以举行仪式。"
    "宰相" "转身离开神殿时，熟悉的黑暗再次包裹了我。"
    "宰相" "再次见到光明时我就在这里了。"
    hide Noah with dissolve

    "他的话中感觉小小姑娘一直都有神奇的力量。"
    "被莉莉丝大人选中的孩子吗......那么多半精灵，为什么偏偏是她......"

    "接下来该听听谁的叙述呢？"

    #选项跳转
    menu:

        "公主":
            jump a_path

        "圣女":
            jump c_path

        "侍卫":
            jump d_path

        "应该没什么要听的内容了。":
            jump e_path


    return

