image bg room15 = "images/bg/15.png"
image bg room16 = "images/bg/16.png"
image bg room17 = "images/bg/17.png"
image bg room18 = "images/bg/18.png"
image gp= "images/characters/others/man2.png"

$ current_avatar = "images/characters/Isaiah/0.png"

image Isaiah = "images/characters/Isaiah/1.png"


label c_path:

    scene bg room2

    "——圣女——"
    $ current_avatar = "images/characters/Isaiah/0.png"
    "和莉莉丝大人长得很像的少女，正在默默祈祷"
    $ current_avatar = None

    show Isaiah at stand_center with dissolve
    "圣女" "莉莉丝大人想让我先介绍一下自己吗？好的，我先梳理一下思路。"
    hide Isaiah with dissolve

    "不只是外貌很像，连气质都很像莉莉斯大人呢。"

    show Isaiah at stand_center with dissolve
    "圣女""我的名字是以赛亚-米勒（Isaiah Millet），是阿祖拉公国的圣女。"
    "圣女""也是莉莉丝大人忠实的信徒。"
    hide Isaiah with dissolve

    scene bg room6
    "圣女""我出生在公国边境一个没有名字的小村落。"
    "圣女""父亲是一名边境骑士，但英年早逝，我与母亲和外公相依为命。"
    "圣女""自我有记忆起，我就知道我的与众不同。"
    "圣女""尖尖的耳朵，完全符合预言中莉莉丝大人的后裔的标准。"
    "圣女""外公说我是被祝福的孩子。"
    "圣女""王国边境时常有魔兽入侵，所以村子里有不少莉莉丝大人的信徒。"
    "圣女""外公也是其中一人。"
    
    scene bg room15
    "圣女""年轻时为保卫国家参加了圣战的外公并没有和他的战友们一样去王城过上衣食无忧的生活，而是选择回到了生养他的这个小村庄。"
    "圣女""他曾对过去的圣女产生过禁忌的爱慕之心，但那时候大家都太年轻，如今那份留恋已变成虔诚的信仰。"
    "圣女""他让我坐在他的腿上，给我讲了无数莉莉丝大人和圣女的故事。"

    scene bg room6
    show gp at stand_center with dissolve
    "“她会静静地来到你的梦里，像我现在这样给你讲故事。”"
    "“只是我给你讲的是过去的事，而她会告诉你未来的事。"
    "“这便是我给你取这个名字的理由。”"
    "“并非是救世的弥赛亚（Messiah），而是预言者以赛亚。”"
    hide gp with dissolve

    scene bg room2
    show Isaiah at stand_center with dissolve
    "圣女""外公其实也不算老，身体健康，精神状态也很好，妈妈负责经营小酒馆，他就负责去搬运沉重的酒桶和食材。"
    "圣女""有一天他说，他做了很奇怪的梦。"
    hide Isaiah with dissolve

    scene bg room8
    "圣女""梦里是金色的大树，有一个熟悉的人影在向他招手。"
    "圣女""他说，他这辈子活这么长已经足够幸福了，虽然有很多遗憾，但也是时候放手了。"
    "“她来接我了。”"

    scene bg room2
    show Isaiah at stand_center with dissolve
    "圣女""之后的那天清晨，我们发现他已经在睡梦中安详地离去，手里攥着一根项链，里面是金发女子的画像。"
    "圣女""......"
    hide Isaiah with dissolve

    "“这里似乎没有那位老人的灵魂，应该是没有一丝遗憾地转生了。”"
    "“说起来，我们又为何在这里徘徊呢，是因为要追随莉莉斯大人吗。”"

    scene bg room16
    "圣女""外公葬礼当天晚上，妈妈的酒馆来了新的一支骑士小队作客。"
    "圣女""带头的人是名为西奥多的半精灵。"
    "圣女""除了他之外小队里还有一个半精灵，以及......"
    "圣女""死灵法师。"
    "圣女""过去那么多年了，我还记得那个男人萦绕在四周令人不适的魔力流。"
    "圣女""领队西奥多不在意这些，他是个没有魔力的异类。"

    show Noah at stand_center with dissolve
    "“死灵法师？那种魔法在王城早就失传啦。”"
    "“他只是有暗魔力的骑士罢了，其实是个很善良的孩子哦，不要讨厌他。”"
    hide Noah with dissolve

    scene bg room2
    show Isaiah at stand_center with dissolve
    "圣女""他说，他们是被莉莉丝抛弃的孩子。"
    "圣女""......我并没有说他觉得莉莉丝大人不好的意思，叔叔，西奥多也给我讲了很多关于莉莉丝大人的传说和预言。"
    "圣女""像外公生前那样......"
    hide Isaiah with dissolve

    scene bg room17
    "圣女""他一手搭在队友的肩上，一手拿着酒杯，给大家讲他曾在书里看过的故事。"
    "圣女""不仅仅是行为举止，连外貌也很像外公年轻的时候。"
    "圣女""绿色的眼睛和黑色的头发。"

    show Noah at stand_center with dissolve
    "“我不知道我爸爸是谁，你也说你爸爸过去有别的爱人，也许我们真是同父异母的兄妹呢。”"
    "“再说了这个小小朋友还是尖耳朵，不知道的人可能会把她当成我亲生的。”"
    "“决定了，从今天开始你是我的妹妹，这个小孩就是我的小侄女了。”"
    hide Nosh with dissolve

    "圣女""他抱着我，让我坐在他的腿上，接着举起酒杯开始狂欢。"
    "圣女""那真的是，非常，非常快乐的时光......"
    "圣女""小队大概每周来酒馆开一次派对，大家都是很友善的人，除了那个死灵法师总是不合群地坐在角落，盯着叔叔看。"
    "圣女""不过有他在才能把醉成一滩烂泥的大家用拖车拖回去。"

    scene bg room6
    "圣女""本以为日子会这样平静地过着。"
    "圣女""就这样过去了好几年......"
    scene bg room8
    "圣女""我做了奇怪的梦，梦里是金色的大树......"
    "圣女""树下金色精灵向我招手，她让我坐在她的身旁，给我讲未来的事......"
    "圣女""叔叔说，那是莉莉丝大人，我不仅是被她祝福的孩子，还是被她选中的圣女。"
    "圣女""我经常会梦见她。"
    "圣女""她教了我很多东西，神学，法术，最重要的是，预言的能力。"
    "圣女""我能够看见，在边境外，森林的深处，那些蠢蠢欲动的黑色物质。"
    "圣女""我把这些事告诉了叔叔，而叔叔他们巡查的结果就是，那里确实是会出现魔兽的地方。"

    scene bg room6
    "圣女""大家完成任务的速度越来越快，受伤的次数也越来越少。"
    "圣女""村民们也不会听见外面魔兽的嘶嚎，也不会有魔兽在大家安眠时闯入。"
    "圣女""日子应该越来越好......"

    scene bg room2
    show Isaiah at stand_center with dissolve
    "圣女""莉莉丝大人，为什么你说他们回不来了呢。"
    hide Isaiah with dissolve

    "少女的眼中充满了泪水。"

    show Isaiah at stand_center with dissolve
    "圣女""他们就那样消失了，没有留下一丝痕迹，只有叔叔和死灵法师侥幸被传送法阵带走了。"
    "圣女""村里的大家至今还在找他们......"
    "圣女""他们到底去哪了......"
    "圣女""叔叔也身负重伤，只能留在王城休养，靠书信和我们来往。"
    "圣女""......"
    "圣女""又过去了好几年。"
    "圣女""叔叔邀请我和妈妈去王城生活，并希望我能进入皇家骑士学院学习。"
    "圣女""妈妈让我独自前去，自己则是留在村子里，她还要继续开她的酒馆，她还要和村民一起去找失踪的人......"
    "圣女""叔叔让我在王城保持低调，尽量不要暴露自己的身份，他不太方便来见我，我们之间保持着书信联系。"
    "圣女""我以为我的校园生活是乏味的，我不需要融入这里，也不准备留在这里，我学习知识和战斗技巧，最后会回到边境，和外公、爸爸、叔叔一样。"
    "圣女""成为一名骄傲的边境骑士。"
    "圣女""但我没想到我会在这个学院遇见令我倾心之人。"
    hide Isaiah with dissolve

    scene bg room5
    "圣女""她是叔叔给我安排的室友。"
    "圣女""是这个国家的长公主。"
    "圣女""虽然她没有被莉莉丝大人祝福，但是我可以看见她金色的魔力。"
    "圣女""是我在这个学院里见到的最纯粹的......"
    "圣女""我把对她感兴趣的这件事都写信告诉了叔叔。"

    scene bg room2
    "“感兴趣的话就和她多交流咯，我很高兴你们能友好相处。”"

    show Isaiah at stand_center with dissolve
    "圣女""叔叔在信里这样写着，并没有太多的表示。"
    "圣女""再说回她，她......"
    "圣女""完全不是我刻板印象中的那种公主。"
    "圣女""她的作息极有规律，早起读书、晚上练法术，连书都按颜色和高度排列。"
    "圣女""我起初以为她只是严谨，后来才知道她不想只是当个公主，最后成为某某皇后，她要成为一名强大的圣骑士，让所有人对她刮目相看。"
    "圣女""她非常体贴亲民，她会在我出门前替我扣好披风，她会把自己不小心烫到的手藏起来不让我担心，她会和我一起熬夜复习，会互相开玩笑在床上扔枕头打架，会为最后一块好吃的蛋糕争执十多分钟......"
    "圣女""有的时候我会忘了她是个公主，倒觉得她像个......我可以触碰的星辰。"
    "圣女""......那段时间我甚至很少梦到莉莉丝大人了，更多的是她......"
    "圣女""我并没有把我的这些事写到信里，只是告诉叔叔我们的关系变得非常亲密了。"
    hide Isaiah with dissolve

    show Noah at stand_center with dissolve
    "“很高兴听到你们感情变好的消息，话说你们完全没有聊到关于我的事吗？”"
    hide Noah with dissolve

    show Isaiah at stand_center with dissolve
    "圣女""叔叔在回信里这样写到，那之后我才知道，叔叔现在的职业是......"
    "圣女""这个国家的宰相。"
    "圣女""......"
    "圣女""之后我立马和她去见了叔叔。"
    hide Isaiah with dissolve

    scene bg room18
    "圣女""华丽的宅邸，沿着走廊到最深处的大门，里面就是宰相的办公室。"
    "圣女""进入房间，见到了多年未见的叔叔，发现岁月真的不会在他的脸上留下任何痕迹，只是头发长长了些许。"
    "圣女""除了叔叔之外，那个死灵法师也在......现在是叔叔的私人侍卫。"
    "圣女""我们交谈了许多，这时我才第一次知道莉莉丝大人的圣女和勇者配对这件事，也从她的眼中看到了一丝她对我不一般的情感。"
    "圣女""所幸叔叔早就有了计划，只不过是针对她的婚约的，对于勇者这一部分，只能听天由命了。"

    scene bg room2
    "圣女""离开叔叔那里之后，我能感觉到她更焦虑了，好像有很多话没有说出来。"

    #公主立绘
    "“其实我心里一直都有人啊！”"
    "圣女""回到宿舍后她突然开始大喊。"
    "“那个人就是你啊！其实我喜欢你很久了！”"
    #立绘消失

    show Isaiah at stand_center with dissolve
    "圣女""我们......互相表达了心意......"
    "圣女""那一刻我多么希望，勇者就是她。"
    "圣女""又或者像她想解除她的婚约那样，去选择自己的幸福，而不是和勇者绑定。"
    "圣女""那我的信仰呢，莉莉丝大人的选择难道会是错的吗......"
    "圣女""我只能祈祷，祈祷我们不会被命运拆散。"
    "圣女""......"
    "圣女""那天她也梦到了金色的大树......"
    "圣女""真的......非常感谢莉莉丝大人能选择她作为勇者。即使不是因为我们的私人愿望，她也是非常优秀的骑士。"
    "圣女""再之后的日子我就陪着她训练，给她打气，休息时会偷跑去平民区约会，在她决斗结束后，趁着假期的尾声邀请她一起回村子里玩。"

    scene bg room6
    "圣女""妈妈在村口等着我们，我很高兴妈妈能接受她。"
    "圣女""我们丢掉脑子一阵疯玩，玩累了有妈妈做的豪华大餐，妈妈还会给我们讲过去在这里饮酒的骑士们的故事。"
    "圣女""快乐的日子总是转瞬即逝的，我们总有回城的一天，不过王城也有叔叔接待，他似乎在准备什么仪式祭典，好向全国人民公开我们的身份。"
    scene bg room0
    "圣女""就这样踏上了返程之路，可本该早就到达歇脚的小城市却迟迟不见踪影。"
    "圣女""夜幕降临，我一时失去了所有的感官，伸手不见五指，也听不见一点风吹草动的声音。"
    "圣女""我尝试跟着感觉走，我相信莉莉丝大人能够指引我前进。"
    scene bg room2
    "圣女""莉莉丝大人......这里究竟是什么地方？"

    "亡灵法师？现在生者之中还有这样的人吗？"
    "这样的人不管是在生界还是亡界都是很危险的要素啊......"
    "接下来该听听谁的叙述呢？"
    

    menu:

        "公主":
            jump a_path

        "宰相":
            jump b_path

        "侍卫":
            jump d_path

        "应该没什么要听的内容了。":
            jump e_path



    return


    
