image bg room19 = "images/bg/19.png"
image bg room20 = "images/bg/20.png"
image bg room21 = "images/bg/21.png"
image bg room22 = "images/bg/22.png"
image bg room23 = "images/bg/23.png"
image bg room24 = "images/bg/24.png"
image bg room25 = "images/bg/25.png"

$ current_avatar = "images/characters/Asche/0.png"

image Asche = "images/characters/Asche/1.png"

image m1= "images/characters/others/maid1.png"
image m2= "images/characters/others/maid2.png"
image m2= "images/characters/others/maid2.png"
image m3= "images/characters/others/man3.png"

transform stand_3:
    anchor (0.5, 1.0)
    align (0.5, 1.0)
    zoom 0.37

label d_path:

    scene bg room2

    "——侍卫——"
    $ current_avatar = "images/characters/Asche/0.png"
    "有异瞳的男人，身上有亡灵的气息"
    $ current_avatar = None

    show Asche at stand_3 with dissolve
    "侍卫" "......"
    "侍卫" "我没什么好和这个女神说的。"
    "侍卫" "我就是普通的侍卫罢了，除此之外没有别的。"
    "侍卫" "......"
    "侍卫" "我......"
    "侍卫" "好吧，从头讲起是吧......"
    hide Asche with dissolve

    "他刚才在看向某处，似乎想得到某人的回应。"
    
    show Asche at stand_3 with dissolve
    "侍卫""我是亚修(Asche)。"
    "侍卫""姓氏......没有。"
    "侍卫""阿祖拉公国现任宰相诺亚的侍卫......也就是私人护卫。"
    hide Asche with dissolve

    scene bg room19
    "侍卫""我的记忆从一个漆黑狭窄的房间开始。"
    "侍卫""“下人的房间”，就是这样的地方。"
    "侍卫""我在那里出生，和两位母亲相依为命。"
    show m1 at stand_1 with dissolve
    show m2 at stand_2 with dissolve
    "侍卫""她们都是最底层的仆人，没有办法选择自己的生存方式。"
    "侍卫""也许是为了给自己找一个依靠，她们选择了彼此。"
    hide m1 with dissolve
    show m2 at stand_center with dissolve
    "侍卫""其中一位曾遭到某个男人强迫而生下了我。"

    scene bg room2
    show Asche at stand_3 with dissolve
    "侍卫""我很高兴她没有因此抛弃，不然我之后也不会得到属于我的幸福......"
    "侍卫""......"
    "侍卫""......她们没有那么幸运了......"
    hide Asche with dissolve

    scene bg room20
    "侍卫""我们生活的房间充满灰尘。"
    "侍卫""我那时从来没有机会离开过这个房间，母亲们不让我出去，有人来巡查时她们便会让我藏在床底。"
    "侍卫""除了她们没有人知道我的存在。"
    "侍卫""......"
    "侍卫""后来从某天开始，生我的那位母亲再也没有回来过。"
    "侍卫""我不知道她发生了什么，她去了哪里。"
    "侍卫""剩下的那位整日以泪洗面，她的头发开始变得枯黄，整个人逐渐消瘦，指甲缝隙充满了泥和血。"
    "侍卫""她整日向着神明祈祷。"
    "侍卫""她说，她被莉莉丝大人诅咒了，她穷其一生都不可能的得到幸福，她只能在深渊里挣扎。"
    "侍卫""房间阴暗狭小，没有光线，她就在这里向代表光明的神祈祷，声音在黑暗中回荡。"
    "侍卫""......"
    "侍卫""她开始变得神神叨叨。"
    "侍卫""......"
    "侍卫""她说都是我的错，如果另一位母亲没有被强迫......如果我没有出生......我才是那个被诅咒的存在。"
    "侍卫""接着她抱着我哭了起来，她说我是另一位母亲留在这个世界上唯一的东西了，她希望我能幸福。"
    "侍卫""就这样又过了几天，她带着满身伤痕跪在我的面前。"

    
    show m1 at stand_center with dissolve
    "“对不起......对不起......我坚持不下去了，我要去陪她了......你要好好活下去......你一定......你一定要找到自己的幸福......求求你......不要怪我......”"
    "侍卫""她说着，拿出来一把小刀，刺入了我的左眼。"
    scene bg room21
    "“我帮你去除......你的诅咒.....”"
    "侍卫""我左边的视线先是一片鲜红，然后什么也感受不到了。"
    "侍卫""她挖出了我的左眼，黑色眼球带着血迹滚到了床底下。"
    "“对不起......真的......对不起......”"
    "侍卫""她一边哭泣一边忏悔，将小刀插入了自己的脖子。"
    "侍卫""房间又回到一片死寂。"
    "侍卫""房间外出现了陌生人的声音。"
    "“这个佣人偷了把银质餐刀，快去把她拖出来，看来今天给她的教训还不够。”"
    "侍卫""接着是开门声，然后是女人的尖叫。"
    "侍卫""......"

    scene bg room2
    "这么看来......这家伙的左眼确实看起来不自然，是义眼吗......"
    "居然使用象征莉莉丝大人的金色，那他应该是个向往光明的人啊，怎么会被诅咒......"
    "说到头来诅咒是什么，真的是莉莉丝大人下的吗？"

    "侍卫""......"
    scene bg room22
    "侍卫""再次睁眼，我身处宽敞明亮的房间。"
    "侍卫""从来没有睡过的温暖且柔软的床，从来没穿过的干净且飘香的衣服。"
    "侍卫""我一度以为我已经死了，那是母亲所说的众神居住的地方。"
    "侍卫""推门而入的女人打断了我的思绪，她穿着和母亲们相似的制服，但是更加整洁。"
    "侍卫""她递来了一套精致的衣服，示意我换上跟她走。"
    "“你父亲在等你。”"
    "侍卫""......"
    "侍卫""我抱着无限疑问跟在她身后。"
    "侍卫""四周是我没见过的景象，走廊，雕塑，画像。"
    "侍卫""这里不是神居住的地方，仅仅只是房间外面的世界。"
    "侍卫""走廊尽头渐渐显露出一扇门的轮廓，深色乌木的光泽在烛光映照下泛出沉静而冷峻的光辉。"
    "“宰相大人在等你。”"
    
    scene bg room23
    show m3 at stand_center with dissolve
    "“你来了啊，你......怎么称呼你?”"
    "侍卫""我不知道，母亲们没教过我说话，也没说过我叫什么。"
    "“好吧......看来完全没有接受过教育......完全是野种......”"
    "“之后会把你送到一位大人那里，你叫什么，要做什么，全都由他决定，顺便在他那里学习一些常识......”"
    "“......虽然我不知道那位大人能有什么常识，你可以走了，听佣人的安排，等人来把你接走。”"
    hide m3 with dissolve
    "侍卫""......"
    "侍卫""那是我第一次，也是最后一次见到这个男人，我只记得他和我一样有一头红色的头发。"

    scene bg room3
    "侍卫""来迎接我的马车比之前我见过的一切都要豪华，车顶端的装饰闪耀着金色的光辉，让我仅剩的眼睛隐隐作痛。"
    "侍卫""随着车渐行渐远，我趴在窗户回头看，才发现我原来生活在多么雄伟的宅邸里。"
    "侍卫""过了一段时间，马车渐渐停下，又一个仆人打扮的女人为我拉开了门，只不过她的制服多了很多细节的暗纹和配饰。"
    "侍卫""眼前是我无法想象的壮丽建筑。"
    "“请跟我来。”"
    "侍卫""我盯着她的裙摆前行，穿过了无数的走廊与房门，似乎走了很远，比马车过来的距离还远。"
    "侍卫""直到感受到一阵微风吹过，我们才又到了室外。"

    scene bg room24
    "侍卫""面前是一片花海。"
    "侍卫""我们继续前行，目标似乎是不远处的独栋。"
    "“记住，进去之后，没有国王的许可，不能出来。”"
    "侍卫""但我并不知道谁是国王。"
    "侍卫""她为我打开了门，让我先进去，并推了我一把。"
    "“那么，好好享受新的人生吧。”"
    "侍卫""身后传来了锁门的声音，她没有跟着我一起进来。"
    "侍卫""我只能趴在窗户旁发呆，看着这个陌生的世界。"
    "“哎呀，这是谁家的小朋友在这里啊？”"
    "侍卫""突然被人从身后抱起，我吓了一大跳。"
    "侍卫""这就是我和他......诺亚的相识过程。"

    scene bg room2
    show Asche at stand_3 with dissolve
    "侍卫""......"
    "侍卫""他教给了我很多东西。"
    "侍卫""我有了名字，学会了说话，甚至可以读写。"
    "侍卫""他还亲自教我剑术，没有魔力的他还尽力教了我魔法。"
    "侍卫""反正这栋宅邸里的人都不能随意进出，我们就这样生活一辈子也不错。"
    "侍卫""直到......"
    hide Asche with dissolve

    scene bg room25
    "侍卫""老国王带着那对双子来到这里。"
    "侍卫""仅仅是第一眼我就明白我不喜欢他们，当然，他们也对我带有敌意。"
    "侍卫""他们带着诺亚离开了这里......"
    "侍卫""我以为我们会被抛弃在这里，可是几个月后双子中的一人便让我也出去。"
    show Noah at stand_center with dissolve
    "“一个不知道算好还是坏的消息，你父亲去世了；好消息，他只有你一个后代。”"
    "“也就是说现在你不仅可以继承他的财产还有他的爵位，你可以回到你出生的那座宅邸之后开始进行贵族式学习，像你这么聪明的孩子大概30岁就能成为我们国家新的宰相了吧。”"
    "“恭喜你，亚修-维罗兰德。”"
    hide Noah with dissolve
    "侍卫""......"
    "侍卫""我不需要这些。"
    "侍卫""不想成为某个大人物的继承人，甚至连自己的名字也都完全舍弃，仅仅作为诺亚-阿祖拉的侍从......"

    scene bg room2
    show Asche at stand_3 with dissolve
    "侍卫""之后的时光可以说是我人生中最幸福的十年......"
    "侍卫""我进入骑士学院，为了成为他唯一的，最优秀最强大的骑士。"
    "侍卫""......我本来只是远远地看着他就够了，已经很满足了，但是发生了一些意外让我对他做了一些比较越界的行为......"
    hide Asche with dissolve
    "侍卫""他接受了我的一切，并带我离开王城，这个让他喘不过气的地方。"

    scene bg room6
    "侍卫""我们的目的地是驻守边境的军营，那里没有人认识我们，没有人打扰我们。"
    "侍卫""......一支以他为首的巡逻小队，一个和他有关系的新的家庭，真的......太过于美好......"
    "侍卫""莉莉丝啊，如果我是你诅咒的人，为什么他们要一起遭殃？"

    scene bg room14
    "侍卫""为什么那些亡灵要把我们拖走，那六个人现在在哪？"
    "侍卫""因为诺亚母亲设下的传送法阵我们才逃过一劫......准确来说是我，诺亚他......"
    "侍卫""我拼尽全力才把他拉回来，莉莉丝，你到底为什么......"
    "侍卫""现在还在为难我们。"

    scene bg room2
    show Asche at stand_3 with dissolve
    "侍卫""光明与命运的女神啊,你到底为什么现在与亡灵为伍，为什么这一切都要围绕着诺亚发生？"
    "侍卫""作为圣女的小姑娘也好，刚刚成为勇者的公主殿下也好......"
    "侍卫""莉莉丝，你被偷走的东西是什么？"
    "侍卫""你到底想要干什么？"
    hide Asche with dissolve

    "真是无礼的人类啊，居然敢质疑莉莉丝大人。"
    "有用的信息没说几句，倒全部是他自己对那个叫诺亚的人的私心。"
    "但这个人身上亡灵的气息......他真的是被诅咒的人吗......"
    "莉莉丝大人啊，现在我也开始感到迷茫了......"

    "接下来该听听谁的叙述呢？"

    #选项跳转
    menu:

        "公主":
            jump a_path

        "宰相":
            jump b_path

        "圣女":
            jump c_path

        "应该没什么要听的内容了。":
            jump e_path


    return
