label m1_path:
    scene bg room35
    show 8 at stand_center with dissolve
    "西奥多""我们的工作很简单。"
    "西奥多""我们的工作类似正规一点的冒险者小队，只不过行动区域和薪水都更固定。"
    "西奥多""我们负责这个村子所在区域的调查、讨伐魔物，一般以六人小队的形式出发。"
    "西奥多""埃瓦里之前是文官，所以主要负责情报汇报，常驻军营。"
    "西奥多""我、卢克索、维利亚三人会轮流协助他。平时出勤任务也由我们三人轮流带队。"
    "西奥多""工作的内容不多，大部分时候都会很轻松，但也不能放松警惕。"
    "西奥多""圣战已经过去几十年，魔物仍源源不断。我不指望我们这一代能彻底解决，但至少要守护好这片土地。"
    "西奥多""不过也说不定呢，命运女神眷顾我们帮我们解决了所有后患之类的。"
    hide 8 with dissolve

    show 4 at stand_center with dissolve
    "伊拉""提问。"
    hide 4 with dissolve

    show 8 at stand_center with dissolve
    "西奥多""请说。"
    hide 8 with dissolve

    show 4 at stand_center with dissolve
    "伊拉""队长是有信仰的人吗？"
    "伊拉""我们会有每周固定的礼拜时间吗？"
    "伊拉""......算了，是我有眼无珠，一个小队里有两个看起来不食人间烟火的精灵少爷，还有个亲戚小姑娘。要说这跟莉莉丝毫无关系，我是不信的。"
    "伊拉""我丑话先说在前面，莉莉丝在冒险者之间并不受欢迎，王公贵族也是。"
    "伊拉""我们大都是没有魔力的平民，连接受正式教育的资格都没有，包括战斗技巧。"
    "伊拉""我们只能靠自己互相支撑，去清理那些贵人眼里‘无足轻重’的麻烦。"
    "伊拉""用你们的话来说，莉莉丝的光芒并没有照耀在我们身上......"
    "伊拉""歧视，偏见......"
    hide 4 with dissolve
    
    show 1 at stand_center with dissolve
    "卢克索""停。"
    "卢克索""首先，任务里可没写要听你抱怨信仰问题。"
    "卢克索""其次，信不信仰是你自己的事。但能站在这里，说明你有真本事，这就够了。"
    "卢克索""最后，我也不信这个女神。"
    hide 1 with dissolve
    
    show 8 at stand_center with dissolve
    "西奥多""感谢卢克索的说明。"
    "西奥多只是笑着拍了拍手。"
    "西奥多""信仰有时候也可以作为我们的精神支柱罢了，信不信都是个人自由。"
    "西奥多""如果伊拉对我的这些说辞有意见的话，我之后会改的，说习惯罢了。"
    "西奥多""其实我也不算是什么被神选中的被祝福的孩子，只不过比你们稍微活得久一点。"
    "西奥多""说不定我活得还没你们久。"
    "西奥多""......"
    "西奥多""不过关于工作还有一些别的内容要补充。"
    "西奥多""秋收的季节我们应该要到这个村子来帮忙，还有举办祭典什么的。"
    "西奥多""不过一些赞颂神明的祭典你们要是不愿意来就不来，这个时期我们的主要任务是帮助平民。"
    "西奥多""那么，自由聊天时间，大家多熟悉一下然后等店员把我们的酒拿过来，这就是我们的新人派对了。"
    hide 8 with dissolve

    scene bg room0
    "貌似开头不是这么愉快，不过也正常。"
    "有很多人都质疑莉莉丝大人。"
    "......"
    "但是他们没有想过，我们诞生，然后在这里相遇，都是命运（莉莉丝）安排好的事情。"

    "还要继续回忆下去吗？"
    menu:
        "是":
            jump m2_path
    return